РасширениеГТС/Джитиис/Documents/КорректировкаРеализации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>КорректировкаРеализации</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СделкиСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НалогообложениеНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЦенаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидКорректировки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПродажаПоЗаказам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипКорректировки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорректировки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидыЗапасовОприходование</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ВидЗапасов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЗапасов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НомерГТД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоПоРНПТ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>23</v8:Digits>
									<v8:FractionDigits>11</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаСНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтавкаНДС</Name>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СкладОтгрузки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ЗаказКлиента</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КодТНВЭД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторТНВЭД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>АналитикаУчетаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаВзаиморасчетов</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Расхождения</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

РасширениеГТС/Джитиис/InformationRegisters/РеестрДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РеестрДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сумма</Name>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерДокументаИБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Проведен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ссылка</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаДокументаИБ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиРеестраДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипСсылки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

РасширениеГТС/Джитиис/Enums/ТипыНалогообложенияНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТипыНалогообложенияНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПродажаНеОблагаетсяНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НалоговыйАгентПоНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПродажаОблагаетсяНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОблагаетсяНДСУПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПродажаОблагаетсяЕНВД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПродажаНаЭкспорт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

РасширениеГТС/Джитиис/Enums/ВариантыОформленияПродажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВариантыОформленияПродажи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РеализацияТоваровУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АктНаПередачуПрав</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

РасширениеГТС/Джитиис/Documents/ЗаказКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаказКлиента</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютнаяОтгрузка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютныйСчетВРубли</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ВариантОбеспечения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыОбеспечения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

РасширениеГТС/Джитиис/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Номенклатура</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ASP_ВидКП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ASP_ВидыКП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиницаИзмеренияТНВЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

РасширениеГТС/Джитиис/Documents/КорректировкаРеализации/Forms/ФормаПодбораТоваровИзЗаказа/Ext/Form/Module.bsl
&НаСервере
&ИзменениеИКонтроль("ПолучитьРезультатЗапросаПоОстаткамЗаказов")
Функция асп_ПолучитьРезультатЗапросаПоОстаткамЗаказов(ДанныеОтбора, СкладРеализации, МассивЗаказов)

	ЭтоПереходПраваСобственности2_5 =
		(ДанныеОтбора.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПереходПраваСобственности);

	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("МассивЗаказов",         МассивЗаказов);
	Запрос.УстановитьПараметр("Партнер",               ДанныеОтбора.Партнер);
	Запрос.УстановитьПараметр("Контрагент",            ДанныеОтбора.Контрагент);
	Запрос.УстановитьПараметр("Договор",               ДанныеОтбора.Договор);
	Запрос.УстановитьПараметр("Организация",           ДанныеОтбора.Организация);
	Запрос.УстановитьПараметр("Сделка",                ДанныеОтбора.Сделка);
	Запрос.УстановитьПараметр("ХозяйственнаяОперация", ДопустимыеОперации());
	Запрос.УстановитьПараметр("Соглашение",            ДанныеОтбора.Соглашение);
	Запрос.УстановитьПараметр("ВалютаВзаиморасчетов",  ДанныеОтбора.ВалютаВзаиморасчетов);
	Запрос.УстановитьПараметр("НалогообложениеНДС",    ДанныеОтбора.НалогообложениеНДС);
	Запрос.УстановитьПараметр("ЦенаВключаетНДС",       ДанныеОтбора.ЦенаВключаетНДС);
	Запрос.УстановитьПараметр("ДокументОснование",     ДанныеОтбора.ДокументОснование);
	Запрос.УстановитьПараметр("СкладРеализации",       СкладРеализации);
	Запрос.УстановитьПараметр("ОтобратьПоЗаказу",      МассивЗаказов <> Неопределено);
	Запрос.УстановитьПараметр("ЭтоПереходПраваСобственности2_5", ЭтоПереходПраваСобственности2_5);
	Запрос.УстановитьПараметр(
		"ИспользоватьСоглашенияСКлиентами",
		ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами"));
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Таблица.Ссылка КАК Распоряжение
	|ПОМЕСТИТЬ ВтРаспоряжения
	|ИЗ
	|	Документ.ЗаказКлиента КАК Таблица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ТаблицаТоваров
	|		ПО Таблица.Ссылка = ТаблицаТоваров.Ссылка
	|ГДЕ
	|	Таблица.Проведен
	|	И Таблица.Партнер = &Партнер
	|	И Таблица.Контрагент = &Контрагент
	|	И Таблица.Договор = &Договор
	|	И Таблица.Организация = &Организация
	|	И Таблица.ХозяйственнаяОперация В(&ХозяйственнаяОперация)
	|	И ВЫБОР
	|		КОГДА НЕ &ИспользоватьСоглашенияСКлиентами
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ
	|			Таблица.Соглашение = &Соглашение
	|	КОНЕЦ
	|	И Таблица.Сделка = &Сделка
	|	И Таблица.Валюта = &ВалютаВзаиморасчетов
	|	И ВЫБОР
	|		КОГДА Таблица.НалогообложениеНДС В
	|			(ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортСырьевыхТоваровУслуг),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортНесырьевыхТоваров))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНаЭкспорт)
	|		ИНАЧЕ
	|			Таблица.НалогообложениеНДС
	|	КОНЕЦ = &НалогообложениеНДС
	|	И Таблица.ЦенаВключаетНДС = &ЦенаВключаетНДС
	|	И ВЫБОР
	|		КОГДА &ЭтоПереходПраваСобственности2_5
	|			ТОГДА ИСТИНА
	|		КОГДА ВЫРАЗИТЬ(&СкладРеализации КАК Справочник.Склады).ЭтоГруппа
	|			ТОГДА ТаблицаТоваров.Склад В ИЕРАРХИИ (&СкладРеализации)
	|		ИНАЧЕ ТаблицаТоваров.Склад = &СкладРеализации
	|	КОНЕЦ
	|	И ТаблицаТоваров.Номенклатура.ВариантОформленияПродажи В
	|		(ЗНАЧЕНИЕ(Перечисление.ВариантыОформленияПродажи.РеализацияТОваровУслуг),
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыОформленияПродажи.АктНаПередачуПрав))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таблица.Ссылка КАК Распоряжение
	|ИЗ
	|	Документ.ЗаявкаНаВозвратТоваровОтКлиента КАК Таблица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаВозвратТоваровОтКлиента.ЗаменяющиеТовары КАК ТаблицаТоваров
	|		ПО Таблица.Ссылка = ТаблицаТоваров.Ссылка
	|ГДЕ
	|	Таблица.Проведен
	|	И Таблица.Партнер = &Партнер
	|	И Таблица.Контрагент = &Контрагент
	|	И Таблица.Договор = &Договор
	|	И Таблица.Организация = &Организация
	|	И Таблица.ХозяйственнаяОперация В(&ХозяйственнаяОперация)
	|	И ВЫБОР
	|		КОГДА НЕ &ИспользоватьСоглашенияСКлиентами
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ
	|			Таблица.Соглашение = &Соглашение
	|	КОНЕЦ
	|	И Таблица.Сделка = &Сделка
	|	И Таблица.Валюта = &ВалютаВзаиморасчетов
	|	И ВЫБОР
	|		КОГДА Таблица.НалогообложениеНДС В
	|			(ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортСырьевыхТоваровУслуг),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортНесырьевыхТоваров))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНаЭкспорт)
	|		ИНАЧЕ
	|			Таблица.НалогообложениеНДС
	|	КОНЕЦ = &НалогообложениеНДС
	|	И Таблица.ЦенаВключаетНДС = &ЦенаВключаетНДС
	|	И ВЫБОР
	|		КОГДА &ЭтоПереходПраваСобственности2_5
	|			ТОГДА ИСТИНА
	|		КОГДА ВЫРАЗИТЬ(&СкладРеализации КАК Справочник.Склады).ЭтоГруппа
	|			ТОГДА ТаблицаТоваров.Склад В ИЕРАРХИИ (&СкладРеализации)
	|		ИНАЧЕ
	|			ТаблицаТоваров.Склад = &СкладРеализации
	|	КОНЕЦ
	|	И ТаблицаТоваров.Номенклатура.ВариантОформленияПродажи В
	|		(ЗНАЧЕНИЕ(Перечисление.ВариантыОформленияПродажи.РеализацияТОваровУслуг),
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыОформленияПродажи.АктНаПередачуПрав))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА Таблица.Исправление
	|			ТОГДА Таблица.ИсправляемыйДокумент
	|		ИНАЧЕ
	|			Таблица.Ссылка
	|	КОНЕЦ КАК Распоряжение
	|ИЗ
	|	Документ.ОтгрузкаТоваровКлиенту КАК Таблица
	|ГДЕ
	|	Таблица.Проведен
	|	И Таблица.Партнер = &Партнер
	|	И Таблица.Контрагент = &Контрагент
	|	И Таблица.Договор = &Договор
	|	И Таблица.Организация = &Организация
	|	И Таблица.ХозяйственнаяОперация В (&ХозяйственнаяОперация)
	|	И ВЫБОР
	|		КОГДА НЕ &ИспользоватьСоглашенияСКлиентами
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ Таблица.Соглашение = &Соглашение
	|	КОНЕЦ
	|	И Таблица.Сделка = &Сделка
	|	И Таблица.Валюта = &ВалютаВзаиморасчетов
	|	И ВЫБОР
	|		КОГДА Таблица.НалогообложениеНДС В
	|			(ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортСырьевыхТоваровУслуг),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортНесырьевыхТоваров))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНаЭкспорт)
	|		ИНАЧЕ
	|			Таблица.НалогообложениеНДС
	|	КОНЕЦ = &НалогообложениеНДС
	|	И &ЦенаВключаетНДС = ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таблица.Партия КАК Распоряжение
	|ИЗ
	|	Документ.ВводОстатковТоваров КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
	|		ПО Таблица.Ссылка = РеестрДокументов.СторнируемыйДокумент
	|		И РеестрДокументов.Проведен
	|		И НЕ РеестрДокументов.ДополнительнаяЗапись
	|ГДЕ
	|	Таблица.Проведен
	|	И Таблица.Организация = &Организация
	|	И Таблица.Партнер = &Партнер
	|	И Таблица.Контрагент = &Контрагент
	|	И Таблица.Договор = &Договор
	|	И ВЫБОР
	|		КОГДА &ЭтоПереходПраваСобственности2_5
	|			ТОГДА ИСТИНА
	|		КОГДА ВЫРАЗИТЬ(&СкладРеализации КАК Справочник.Склады).ЭтоГруппа
	|			ТОГДА Таблица.Склад В ИЕРАРХИИ (&СкладРеализации)
	|		ИНАЧЕ
	|			Таблица.Склад = &СкладРеализации
	|	КОНЕЦ
	|	И Таблица.Валюта = &ВалютаВзаиморасчетов
	|	И Таблица.ХозяйственнаяОперация В(&ХозяйственнаяОперация)
	|	И Таблица.Партия <> ЗНАЧЕНИЕ(Документ.ПервичныйДокумент.ПустаяСсылка)
	|	И ВЫБОР
	|		КОГДА Таблица.НалогообложениеНДС В(
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортСырьевыхТоваровУслуг),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортНесырьевыхТоваров)
	|			)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНаЭкспорт)
	|		ИНАЧЕ
	|			Таблица.НалогообложениеНДС
	|	КОНЕЦ = &НалогообложениеНДС
	|	И РеестрДокументов.Ссылка ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗаказы.ЗаказКлиента КАК ЗаказКлиента,
	|	ТаблицаЗаказы.Номенклатура КАК Номенклатура,
	|	ТаблицаЗаказы.Характеристика КАК Характеристика,
	|	ТаблицаЗаказы.КодСтроки КАК КодСтроки,
	|	ТаблицаЗаказы.Склад КАК Склад,
	|	ТаблицаЗаказы.Серия КАК Серия,
	|	СУММА(ТаблицаЗаказы.КОформлению) КАК Количество,
	|	СУММА(ТаблицаЗаказы.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ТаблицаОстатки
	|ИЗ
	|	(ВЫБРАТЬ
	|		РаспоряженияОбороты.Распоряжение КАК ЗаказКлиента,
	|		РаспоряженияОбороты.Номенклатура КАК Номенклатура,
	|		РаспоряженияОбороты.Характеристика КАК Характеристика,
	|		РаспоряженияОбороты.КодСтроки КАК КодСтроки,
	|		РаспоряженияОбороты.Склад КАК Склад,
	|		РаспоряженияОбороты.Серия КАК Серия,
	|		РаспоряженияОбороты.ОтгруженоКоличествоОборот
	|			- РаспоряженияОбороты.КОтгрузкеКоличествоОборот КАК КОформлению,
	|		РаспоряженияОбороты.ОтгруженоСуммаОборот
	|			- РаспоряженияОбороты.КОтгрузкеСуммаОборот КАК Сумма
	|	ИЗ
	|		#РаспоряженияНаОтгрузкуОборотыРазвернутая1 КАК РаспоряженияОбороты
	|	ГДЕ
	|		НЕ &ЭтоПереходПраваСобственности2_5
	|		И (РаспоряженияОбороты.ОтгруженоКоличествоОборот
	|			- РаспоряженияОбороты.КОтгрузкеКоличествоОборот <> 0
	|			ИЛИ РаспоряженияОбороты.ОтгруженоСуммаОборот
	|				- РаспоряженияОбороты.КОтгрузкеСуммаОборот <> 0)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		РаспоряженияОбороты.Распоряжение КАК ЗаказКлиента,
	|		РаспоряженияОбороты.Номенклатура КАК Номенклатура,
	|		РаспоряженияОбороты.Характеристика КАК Характеристика,
	|		РаспоряженияОбороты.КодСтроки КАК КодСтроки,
	|		ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка) КАК Склад,
	|		МАКСИМУМ(РаспоряженияОбороты.Серия) КАК Серия,
	|		СУММА(РаспоряженияОбороты.ОтгруженоКоличествоОборот
	|			+ РаспоряженияОбороты.ОприходованоДоППСКоличествоОборот
	|			- РаспоряженияОбороты.СписаноДоППСКоличествоОборот
	|			- РаспоряженияОбороты.ПринятоКоличествоОборот
	|			- РаспоряженияОбороты.ОформленоКоличествоОборот) КАК КОформлению,
	|		СУММА(РаспоряженияОбороты.ОтгруженоСуммаОборот
	|			+ РаспоряженияОбороты.ОприходованоДоППССуммаОборот
	|			- РаспоряженияОбороты.СписаноДоППССуммаОборот
	|			- РаспоряженияОбороты.ПринятоСуммаОборот
	|			- РаспоряженияОбороты.ОформленоСуммаОборот) КАК Сумма
	|	ИЗ
	|		#РаспоряженияНаОтгрузкуОборотыРазвернутая2 КАК РаспоряженияОбороты
	|	ГДЕ
	|		&ЭтоПереходПраваСобственности2_5
	|	
	|	СГРУППИРОВАТЬ ПО
	|		РаспоряженияОбороты.Распоряжение,
	|		РаспоряженияОбороты.Номенклатура,
	|		РаспоряженияОбороты.Характеристика,
	|		РаспоряженияОбороты.КодСтроки
	|	
	|	ИМЕЮЩИЕ
	|		СУММА(РаспоряженияОбороты.ОтгруженоКоличествоОборот
	|			+ РаспоряженияОбороты.ОприходованоДоППСКоличествоОборот
	|			- РаспоряженияОбороты.СписаноДоППСКоличествоОборот
	|			- РаспоряженияОбороты.ПринятоКоличествоОборот
	|			- РаспоряженияОбороты.ОформленоКоличествоОборот) <> 0
	|		ИЛИ СУММА(РаспоряженияОбороты.ОтгруженоСуммаОборот
	|			+ РаспоряженияОбороты.ОприходованоДоППССуммаОборот
	|			- РаспоряженияОбороты.СписаноДоППССуммаОборот
	|			- РаспоряженияОбороты.ПринятоСуммаОборот
	|			- РаспоряженияОбороты.ОформленоСуммаОборот) <> 0
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РаспоряженияДвижения.Распоряжение КАК ЗаказКлиента,
	|		РаспоряженияДвижения.Номенклатура КАК Номенклатура,
	|		РаспоряженияДвижения.Характеристика КАК Характеристика,
	|		РаспоряженияДвижения.КодСтроки КАК КодСтроки,
	|		РаспоряженияДвижения.Склад КАК Склад,
	|		РаспоряженияДвижения.Серия КАК Серия,
	|		РаспоряженияДвижения.Количество КАК Количество,
	|		РаспоряженияДвижения.Сумма КАК Сумма
	|	ИЗ
	|		РегистрНакопления.РаспоряженияНаОтгрузкуИВозврат КАК РаспоряженияДвижения
	|	ГДЕ
	|		(РаспоряженияДвижения.Регистратор = &ДокументОснование
	|			ИЛИ РаспоряженияДвижения.Регистратор В
	|				(ВЫБРАТЬ
	|					Корректировки.Ссылка
	|				ИЗ
	|					Документ.КорректировкаРеализации КАК Корректировки
	|				ГДЕ
	|					Корректировки.ДокументОснование = &ДокументОснование
	|					И Корректировки.Проведен))
	|		И РаспоряженияДвижения.Показатель = ЗНАЧЕНИЕ(Перечисление.ПоказателиРаспоряженийНаОтгрузкуИВозврат.Отгружено)
	|		И ВЫБОР
	|			КОГДА &ОтобратьПоЗаказу
	|				ТОГДА РаспоряженияДвижения.Распоряжение В (&МассивЗаказов)
	|			ИНАЧЕ
	|				РаспоряженияДвижения.Распоряжение В
	|					(ВЫБРАТЬ
	|						Распоряжение
	|					ИЗ
	|						ВтРаспоряжения)
	|		КОНЕЦ
	|		И РаспоряженияДвижения.Активность
	|		И ВЫБОР
	|				КОГДА ВЫРАЗИТЬ(&СкладРеализации КАК Справочник.Склады).ЭтоГруппа
	|					ТОГДА РаспоряженияДвижения.Склад В ИЕРАРХИИ (&СкладРеализации)
	|							ИЛИ РаспоряженияДвижения.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|				ИНАЧЕ РаспоряженияДвижения.Склад В (ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка), &СкладРеализации)
	|			КОНЕЦ
	|		И РаспоряженияДвижения.Номенклатура.ВариантОформленияПродажи В (ЗНАЧЕНИЕ(Перечисление.ВариантыОформленияПродажи.РеализацияТОваровУслуг),
	|						ЗНАЧЕНИЕ(Перечисление.ВариантыОформленияПродажи.АктНаПередачуПрав))) КАК ТаблицаЗаказы
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗаказы.ЗаказКлиента,
	|	ТаблицаЗаказы.Номенклатура,
	|	ТаблицаЗаказы.Характеристика,
	|	ТаблицаЗаказы.КодСтроки,
	|	ТаблицаЗаказы.Склад,
	|	ТаблицаЗаказы.Серия
	|
	|ИМЕЮЩИЕ
	|	СУММА(ТаблицаЗаказы.КОформлению) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтавкиНДСНоменклатуры.Номенклатура КАК Номенклатура,
	|	СтавкиНДСНоменклатуры.СтавкаНДС КАК СтавкаНДС
	|ПОМЕСТИТЬ СтавкиНДСНоменклатуры
	|ИЗ
	|	РегистрСведений.СтавкиНДСНоменклатуры.СрезПоследних(
	|		&Дата,
	|		(Страна = &СтранаРегистрации
	|			ИЛИ Страна = ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка))
	|		И Номенклатура В (ВЫБРАТЬ 
	|								Номенклатура 
	|							ИЗ 
	|								ТаблицаОстатки)
	|	) КАК СтавкиНДСНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОсновныеСтавкиНДС.СтавкаНДС
	|ПОМЕСТИТЬ ОсновныеСтавкиНДС
	|ИЗ
	|	РегистрСведений.ОсновныеСтавкиНДС.СрезПоследних(
	|		&Дата,
	|		Страна = &СтранаРегистрации
	|	) КАК ОсновныеСтавкиНДС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаОстатки.ЗаказКлиента КАК ЗаказКлиента,
	|	ТаблицаОстатки.Номенклатура КАК Номенклатура,
	|	ТаблицаОстатки.Характеристика КАК Характеристика,
	|	ТаблицаТовары.Серия КАК Серия,
	|	ТаблицаОстатки.КодСтроки КАК КодСтроки,
	|	ТаблицаОстатки.Количество КАК Количество,
	|	ТаблицаОстатки.Сумма КАК СуммаВзаиморасчетов,
	|	ТаблицаОстатки.Склад КАК Склад,
	|	ТаблицаТовары.НоменклатураНабора КАК НоменклатураНабора,
	|	ТаблицаТовары.ХарактеристикаНабора КАК ХарактеристикаНабора,
	|	ТаблицаТовары.Подразделение КАК Подразделение,
	|	ТаблицаТовары.НомерСтроки КАК НомерСтроки,
	|	ТаблицаТовары.Ссылка.Сделка КАК Сделка,
	|	ТаблицаТовары.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ТаблицаТовары.Упаковка КАК Упаковка, 
	#Удаление
	|	ТаблицаТовары.ВидЦены КАК ВидЦены,
	#КонецУдаления
	|	ТаблицаТовары.Количество КАК КоличествоВЗаказе,
	#Удаление
	|	ТаблицаТовары.Цена КАК Цена,
	#КонецУдаления
	|	ТаблицаТовары.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаТовары.Сумма КАК Сумма,
	|	ТаблицаТовары.СуммаНДС КАК СуммаНДС,
	|	ТаблицаОстатки.Сумма КАК СуммаСНДС,
	|	ТаблицаТовары.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
    #Вставка
	//++ ASP_Спиряева 15.07.2025 000027514 по аналогии с ТекстЗапросаПоИсходнымДаннымРеализацияТоваровУслуг
	|ВЫБОР                  	
	|КОГДА (ВЫРАЗИТЬ(ЗаказТовары.Цена * ТаблицаОстатки.Количество КАК ЧИСЛО(31, 2))) = ТаблицаОстатки.Сумма
	|	ТОГДА ЗаказТовары.Цена
	|ИНАЧЕ ВЫРАЗИТЬ(ТаблицаОстатки.Сумма / ТаблицаОстатки.Количество КАК ЧИСЛО(31, 2))
	|КОНЕЦ КАК Цена, 
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(ЗаказТовары.Цена * ТаблицаОстатки.Количество КАК ЧИСЛО(31, 2))) = ТаблицаОстатки.Сумма
	|			ТОГДА ЗаказТовары.ВидЦены
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|	КОНЕЦ КАК ВидЦены,
	//-- ASP_Спиряева 15.07.2025 000027514
 	#КонецВставки  
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА 1
	|		ИНАЧЕ &ТекстЗапросаКоэффициентУпаковки
	|	КОНЕЦ КАК Коэффициент,
	|	ТаблицаОстатки.Количество / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 1) КАК КоличествоУпаковок,
	|	ТаблицаТовары.СрокПоставки КАК СрокПоставки
	|ИЗ
	|	ТаблицаОстатки КАК ТаблицаОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ТаблицаТовары
	|		ПО ТаблицаОстатки.Номенклатура = ТаблицаТовары.Номенклатура
	|			И ТаблицаОстатки.Характеристика = ТаблицаТовары.Характеристика
	|			И ТаблицаОстатки.КодСтроки = ТаблицаТовары.КодСтроки
	|			И ТаблицаОстатки.ЗаказКлиента = ТаблицаТовары.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаОстатки.ЗаказКлиента КАК ЗаказКлиента,
	|	ТаблицаОстатки.Номенклатура КАК Номенклатура,
	|	ТаблицаОстатки.Характеристика КАК Характеристика,
	|	ТаблицаТовары.Серия КАК Серия,
	|	ТаблицаОстатки.КодСтроки КАК КодСтроки,
	|	ТаблицаОстатки.Количество КАК Количество,
	|	ТаблицаОстатки.Сумма КАК СуммаВзаиморасчетов,
	|	ТаблицаОстатки.Склад КАК Склад,
	|	ТаблицаТовары.НоменклатураНабора КАК НоменклатураНабора,
	|	ТаблицаТовары.ХарактеристикаНабора КАК ХарактеристикаНабора,
	|	ТаблицаТовары.Подразделение КАК Подразделение,
	|	ТаблицаТовары.НомерСтроки КАК НомерСтроки,
	|	ТаблицаТовары.Ссылка.Сделка КАК Сделка,
	|	ТаблицаТовары.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ТаблицаТовары.Упаковка КАК Упаковка,
	#Удаление
	|	ТаблицаТовары.ВидЦены КАК ВидЦены,
	#КонецУдаления
	|	ТаблицаТовары.Количество КАК КоличествоВЗаказе,
	#Удаление
	|	ТаблицаТовары.Цена КАК Цена,
	#КонецУдаления
	|	ТаблицаТовары.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаТовары.Сумма КАК Сумма,
	|	ТаблицаТовары.СуммаНДС КАК СуммаНДС,
	|	ТаблицаОстатки.Сумма КАК СуммаСНДС,
	|	ТаблицаТовары.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	#Вставка
	//++ ASP_Спиряева 15.07.2025 000027514 по аналогии с ТекстЗапросаПоИсходнымДаннымРеализацияТоваровУслуг
	|ВЫБОР                  	
	|КОГДА (ВЫРАЗИТЬ(ЗаказТовары.Цена * ТаблицаОстатки.Количество КАК ЧИСЛО(31, 2))) = ТаблицаОстатки.Сумма
	|	ТОГДА ЗаказТовары.Цена
	|ИНАЧЕ ВЫРАЗИТЬ(ТаблицаОстатки.Сумма / ТаблицаОстатки.Количество КАК ЧИСЛО(31, 2))
	|КОНЕЦ КАК Цена, 
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(ЗаказТовары.Цена * ТаблицаОстатки.Количество КАК ЧИСЛО(31, 2))) = ТаблицаОстатки.Сумма
	|			ТОГДА ЗаказТовары.ВидЦены
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|	КОНЕЦ КАК ВидЦены,
	//-- ASP_Спиряева 15.07.2025 000027514
	#КонецВставки 
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА 1
	|		ИНАЧЕ &ТекстЗапросаКоэффициентУпаковки
	|	КОНЕЦ КАК Коэффициент,
	|	ТаблицаОстатки.Количество / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 1) КАК КоличествоУпаковок,
	|	ТаблицаТовары.СрокПоставки КАК СрокПоставки
	|ИЗ
	|	ТаблицаОстатки КАК ТаблицаОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаВозвратТоваровОтКлиента.ЗаменяющиеТовары КАК ТаблицаТовары
	|		ПО ТаблицаОстатки.Номенклатура = ТаблицаТовары.Номенклатура
	|			И ТаблицаОстатки.Характеристика = ТаблицаТовары.Характеристика
	|			И ТаблицаОстатки.КодСтроки = ТаблицаТовары.КодСтроки
	|			И ТаблицаОстатки.ЗаказКлиента = ТаблицаТовары.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаОстатки.ЗаказКлиента КАК ЗаказКлиента,
	|	ТаблицаОстатки.Номенклатура КАК Номенклатура,
	|	ТаблицаОстатки.Характеристика КАК Характеристика,
	|	ТаблицаТовары.Серия КАК Серия,
	|	ТаблицаОстатки.КодСтроки КАК КодСтроки,
	|	ТаблицаОстатки.Количество КАК Количество,
	|	ТаблицаОстатки.Сумма КАК СуммаВзаиморасчетов,
	|	ТаблицаОстатки.Склад КАК Склад,
	|	ТаблицаТовары.НоменклатураНабора КАК НоменклатураНабора,
	|	ТаблицаТовары.ХарактеристикаНабора КАК ХарактеристикаНабора,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК Подразделение,
	|	ТаблицаТовары.НомерСтроки КАК НомерСтроки,
	|	ТаблицаТовары.Ссылка.Сделка КАК Сделка,
	|	ТаблицаТовары.Ссылка.Дата КАК ДатаОтгрузки,
	|	ТаблицаТовары.Упаковка КАК Упаковка,
	|	ТаблицаТовары.ВидЦены КАК ВидЦены,
	|	ТаблицаТовары.Количество КАК КоличествоВЗаказе,
	|	ТаблицаТовары.Цена КАК Цена,
	|	&СтавкаНДСОтгрузкаТоваровБезРаспоряжения КАК СтавкаНДС,
	|	ТаблицаТовары.Сумма КАК Сумма,
	|	0 КАК СуммаНДС,
	|	ТаблицаОстатки.Сумма КАК СуммаСНДС,
	|	ТаблицаТовары.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА 1
	|		ИНАЧЕ &ТекстЗапросаКоэффициентУпаковки
	|	КОНЕЦ КАК Коэффициент,
	|	ТаблицаОстатки.Количество / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 1) КАК КоличествоУпаковок,
	|	ТаблицаТовары.СрокПоставки КАК СрокПоставки
	|ИЗ
	|	ТаблицаОстатки КАК ТаблицаОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтгрузкаТоваровКлиенту.Товары КАК ТаблицаТовары
	|		ПО ТаблицаОстатки.Номенклатура = ТаблицаТовары.Номенклатура
	|			И ТаблицаОстатки.Характеристика = ТаблицаТовары.Характеристика
	|			И ТаблицаОстатки.КодСтроки = ТаблицаТовары.КодСтроки
	|			И ТаблицаОстатки.ЗаказКлиента = ТаблицаТовары.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ СтавкиНДСНоменклатуры КАК СтавкиНДСНоменклатуры
	|		ПО СтавкиНДСНоменклатуры.Номенклатура = ТаблицаТовары.Номенклатура
	|	ЛЕВОЕ СОЕДИНЕНИЕ ОсновныеСтавкиНДС КАК ОсновныеСтавкиНДС
	|		ПО ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаОстатки.ЗаказКлиента КАК ЗаказКлиента,
	|	ТаблицаОстатки.Номенклатура КАК Номенклатура,
	|	ТаблицаОстатки.Характеристика КАК Характеристика,
	|	ТаблицаТовары.Серия КАК Серия,
	|	ТаблицаОстатки.КодСтроки КАК КодСтроки,
	|	ТаблицаОстатки.Количество КАК Количество,
	|	ТаблицаОстатки.Сумма КАК СуммаВзаиморасчетов,
	|	ТаблицаОстатки.Склад КАК Склад,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК НоменклатураНабора,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК ХарактеристикаНабора,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК Подразделение,
	|	ТаблицаТовары.НомерСтроки КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(Справочник.СделкиСКлиентами.ПустаяСсылка) КАК Сделка,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаОтгрузки,
	|	ТаблицаТовары.Упаковка КАК Упаковка,
	|	ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка) КАК ВидЦены,
	|	ТаблицаТовары.Количество КАК КоличествоВЗаказе,
	|	ТаблицаТовары.Цена КАК Цена,
	|	&СтавкаНДСОтгрузкаТоваровБезРаспоряжения КАК СтавкаНДС,
	|	ТаблицаТовары.Сумма КАК Сумма,
	|	0 КАК СуммаНДС,
	|	ТаблицаОстатки.Сумма КАК СуммаСНДС,
	|	ТаблицаТовары.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА 1
	|		ИНАЧЕ &ТекстЗапросаКоэффициентУпаковки
	|	КОНЕЦ КАК Коэффициент,
	|	ТаблицаОстатки.Количество / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 1) КАК КоличествоУпаковок,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК СрокПоставки
	|ИЗ
	|	ТаблицаОстатки КАК ТаблицаОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВводОстатковТоваров.Товары КАК ТаблицаТовары
	|		ПО ТаблицаОстатки.Номенклатура = ТаблицаТовары.Номенклатура
	|			И ТаблицаОстатки.Характеристика = ТаблицаТовары.Характеристика
	|			И ТаблицаОстатки.КодСтроки = ТаблицаТовары.КодСтроки
	|			И ТаблицаОстатки.ЗаказКлиента = ТаблицаТовары.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ СтавкиНДСНоменклатуры КАК СтавкиНДСНоменклатуры
	|		ПО СтавкиНДСНоменклатуры.Номенклатура = ТаблицаТовары.Номенклатура
	|	ЛЕВОЕ СОЕДИНЕНИЕ ОсновныеСтавкиНДС КАК ОсновныеСтавкиНДС
	|		ПО ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаОстатки.ЗаказКлиента КАК ЗаказКлиента,
	|	ТаблицаОстатки.Номенклатура КАК Номенклатура,
	|	ТаблицаОстатки.Характеристика КАК Характеристика,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА ТаблицаТовары.Серия ЕСТЬ НЕ NULL И ТаблицаТовары.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|			ТОГДА ТаблицаТовары.Серия
	|		КОГДА ОприходованиеТовары.Серия ЕСТЬ НЕ NULL И ОприходованиеТовары.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|			ТОГДА ОприходованиеТовары.Серия
	|		ИНАЧЕ
	|			ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ) КАК Серия,
	|	ТаблицаОстатки.КодСтроки КАК КодСтроки,
	|	МАКСИМУМ(ТаблицаОстатки.Количество) КАК Количество,
	|	МАКСИМУМ(ТаблицаОстатки.Сумма) КАК СуммаВзаиморасчетов,
	|	ТаблицаОстатки.Склад КАК Склад,
	|	МАКСИМУМ(ЕСТЬNULL(ТаблицаТовары.НоменклатураНабора, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))) КАК НоменклатураНабора,
	|	МАКСИМУМ(ЕСТЬNULL(ТаблицаТовары.ХарактеристикаНабора, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))) КАК ХарактеристикаНабора,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК Подразделение,
	|	МАКСИМУМ(ЕСТЬNULL(ТаблицаТовары.НомерСтроки, 0)) КАК НомерСтроки,
	|	МАКСИМУМ(ЕСТЬNULL(ТаблицаТовары.Ссылка.Сделка, ОприходованиеТовары.Ссылка.Сделка)) КАК Сделка,
	|	МАКСИМУМ(ЕСТЬNULL(ТаблицаТовары.Ссылка.Дата, ОприходованиеТовары.Ссылка.Дата)) КАК ДатаОтгрузки,
	|	ТаблицаОстатки.Номенклатура.ЕдиницаИзмерения КАК Упаковка,
	|	ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка) КАК ВидЦены,
	|	СУММА(ЕСТЬNULL(ТаблицаТовары.Количество, 0) + ЕСТЬNULL(ОприходованиеТовары.Количество, 0)) КАК КоличествоВЗаказе,
	|	МАКСИМУМ(ЕСТЬNULL(ТаблицаТовары.Цена, ОприходованиеТовары.Цена)) КАК Цена,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА ТаблицаТовары.Ссылка ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)
	|		ИНАЧЕ
	|			&СтавкаНДСОтгрузкаТоваровБезРаспоряжения
	|	КОНЕЦ) КАК СтавкаНДС,
	|	СУММА(ЕСТЬNULL(ТаблицаТовары.Сумма, 0) + ЕСТЬNULL(ОприходованиеТовары.Сумма, 0)) КАК Сумма,
	|	0 КАК СуммаНДС,
	|	МАКСИМУМ(ТаблицаОстатки.Сумма) КАК СуммаСНДС,
	|	ТаблицаОстатки.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	1 КАК Коэффициент,
	|	МАКСИМУМ(ТаблицаОстатки.Количество) КАК КоличествоУпаковок,
	|	МАКСИМУМ(ЕСТЬNULL(ТаблицаТовары.СрокПоставки, 0)) КАК СрокПоставки
	|ИЗ
	|	ТаблицаОстатки КАК ТаблицаОстатки
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтгрузкаТоваровКлиенту.Товары КАК ТаблицаТовары
	|		ПО ТаблицаОстатки.Номенклатура = ТаблицаТовары.Номенклатура
	|			И ТаблицаОстатки.Характеристика = ТаблицаТовары.Характеристика
	|			И ТаблицаОстатки.КодСтроки = ТаблицаТовары.КодСтроки
	|			И ТаблицаТовары.КодСтроки = 0
	|			И ТаблицаОстатки.ЗаказКлиента = ТаблицаТовары.ЗаказКлиента
	|			И ТаблицаТовары.Ссылка.Проведен
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОприходованиеИзлишковОтгруженныхТоваров.Товары КАК ОприходованиеТовары
	|		ПО ТаблицаОстатки.Номенклатура = ОприходованиеТовары.Номенклатура
	|			И ТаблицаОстатки.Характеристика = ОприходованиеТовары.Характеристика
	|			И ТаблицаОстатки.ЗаказКлиента = ОприходованиеТовары.Распоряжение
	|			И ОприходованиеТовары.Ссылка.Проведен
	|	ЛЕВОЕ СОЕДИНЕНИЕ СтавкиНДСНоменклатуры КАК СтавкиНДСНоменклатуры
	|		ПО СтавкиНДСНоменклатуры.Номенклатура = ТаблицаОстатки.Номенклатура
	|	ЛЕВОЕ СОЕДИНЕНИЕ ОсновныеСтавкиНДС КАК ОсновныеСтавкиНДС
	|		ПО ИСТИНА
	|ГДЕ
	|	ТаблицаОстатки.КодСтроки = 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаОстатки.ЗаказКлиента,
	|	ТаблицаОстатки.Номенклатура,
	|	ТаблицаОстатки.Характеристика,
	|	ТаблицаОстатки.КодСтроки,
	|	ТаблицаОстатки.Склад
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТаблицаОстатки.ЗаказКлиента,
	|	ТаблицаТовары.НомерСтроки,
	|	ТаблицаОстатки.Номенклатура,
	|	ТаблицаОстатки.Характеристика,
	|	ТаблицаОстатки.Склад,
	|	ТаблицаТовары.ДатаОтгрузки
	|";
	
	// РаспоряженияНаОтгрузкуОборотыРазвернутая1
	ПараметрыФормированияТаблицы = РегистрыНакопления.РаспоряженияНаОтгрузкуИВозврат.НовыйПараметрыФормированияРазвернутойТаблицы();
	ПараметрыФормированияТаблицы.ТекстУсловия =
		"ВЫБОР
		|	КОГДА &ОтобратьПоЗаказу
		|		ТОГДА Распоряжение В (&МассивЗаказов)
		|	ИНАЧЕ
		|		Распоряжение В(
		|			ВЫБРАТЬ
		|				Распоряжение
		|			ИЗ
		|				ВтРаспоряжения)
		|	КОНЕЦ
		|	И ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(&СкладРеализации КАК Справочник.Склады).ЭтоГруппа
		|			ТОГДА Склад В ИЕРАРХИИ (&СкладРеализации)
		|					ИЛИ Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
		|		ИНАЧЕ Склад В (ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка), &СкладРеализации)
		|	КОНЕЦ
		|	И Номенклатура.ВариантОформленияПродажи В(
		|		ЗНАЧЕНИЕ(Перечисление.ВариантыОформленияПродажи.РеализацияТОваровУслуг),
		|		ЗНАЧЕНИЕ(Перечисление.ВариантыОформленияПродажи.АктНаПередачуПрав)
		|		)
		|";
	ПараметрыФормированияТаблицы.Группировка = "Распоряжение, Номенклатура, Характеристика, КодСтроки, Склад, Серия";
	ПараметрыФормированияТаблицы.Показатели = "КОтгрузке, Отгружено";
	ПараметрыФормированияТаблицы.Ресурсы = "Количество, Сумма";
	
	РаспоряженияНаОтгрузкуОборотыРазвернутая1 =
		РегистрыНакопления.РаспоряженияНаОтгрузкуИВозврат.ТекстЗапросаРазвернутаяТаблица(
			ПараметрыФормированияТаблицы);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,
		"#РаспоряженияНаОтгрузкуОборотыРазвернутая1",
		РаспоряженияНаОтгрузкуОборотыРазвернутая1);
	
	// РаспоряженияНаОтгрузкуОборотыРазвернутая2
	ПараметрыФормированияТаблицы = РегистрыНакопления.РаспоряженияНаОтгрузкуИВозврат.НовыйПараметрыФормированияРазвернутойТаблицы();
	ПараметрыФормированияТаблицы.ТекстУсловия =
		"ВЫБОР
		|		КОГДА &ОтобратьПоЗаказу
		|			ТОГДА Распоряжение В (&МассивЗаказов)
		|		ИНАЧЕ Распоряжение В
		|			(ВЫБРАТЬ
		|				Распоряжение
		|			ИЗ
		|				ВтРаспоряжения)
		|	КОНЕЦ
		|	И Номенклатура.ВариантОформленияПродажи В
		|		(ЗНАЧЕНИЕ(Перечисление.ВариантыОформленияПродажи.РеализацияТОваровУслуг),
		|		ЗНАЧЕНИЕ(Перечисление.ВариантыОформленияПродажи.АктНаПередачуПрав))";
	ПараметрыФормированияТаблицы.Группировка = "Распоряжение, Номенклатура, Характеристика, КодСтроки, Серия";
	ПараметрыФормированияТаблицы.Показатели = "Отгружено, ОприходованоДоППС, СписаноДоППС, Принято, Оформлено";
	ПараметрыФормированияТаблицы.Ресурсы = "Количество, Сумма";
	
	РаспоряженияНаОтгрузкуОборотыРазвернутая2 =
		РегистрыНакопления.РаспоряженияНаОтгрузкуИВозврат.ТекстЗапросаРазвернутаяТаблица(
			ПараметрыФормированияТаблицы);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,
		"#РаспоряженияНаОтгрузкуОборотыРазвернутая2",
		РаспоряженияНаОтгрузкуОборотыРазвернутая2);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,
		"&ТекстЗапросаКоэффициентУпаковки",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
		"ТаблицаТовары.Упаковка",
		"ТаблицаТовары.Номенклатура"));
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,
		"&СтавкаНДСОтгрузкаТоваровБезРаспоряжения",
		УчетНДСУП.ТекстЗапросаСтавкаНДС(
			"ТаблицаТовары.Ссылка.НалогообложениеНДС",
			"ТаблицаТовары.Номенклатура"));
	
	УчетНДСУП.УстановитьПараметрыЗапросаСтавкиНДС(
		Запрос.Параметры,
		ДанныеОтбора.Организация,
		?(ЗначениеЗаполнено(ДанныеОтбора.Дата),
			ДанныеОтбора.Дата,
			НачалоДня(ТекущаяДатаСеанса())));
		
	УстановитьПривилегированныйРежим(Истина);
	
	Возврат Запрос.Выполнить();

КонецФункции
